Revit 2024 API
ParameterSet.Insert Method
Insert the specified parameter into the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	Parameter item
)
Visual Basic
Public Overridable Function Insert ( _
	item As Parameter _
) As Boolean
Visual C++
public:
virtual bool Insert(
	Parameter^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Parameter
The parameter to be inserted into the set.
Return Value
Returns whether the parameter was inserted into the set.
See Also
ParameterSet Class
Autodesk.Revit.DB Namespace